class Mdash.Tret.Date extends Mdash.Tret

  classes:
    nowrap: 'white-space:nowrap;'

  rules:

    # Установка тире и пробельных символов в периодах дат
    years:
      pattern: [
        /(с|по|период|середины|начала|начало|конца|конец|половины|в|между|\([cс]\)|\&copy\;)(\s+|\&nbsp\;)([\d]{4})(-|\&mdash\;|\&minus\;)([\d]{4})(( |\&nbsp\;)?(г\.г\.|гг\.|гг|г\.|г)([^а-яёa-z]))?/gi
      ]
      replacement: [
        -> "#{$1}#{$2}" + (if parseInt($3) >= parseInt($5) then "#{$3}#{$4}#{$5}" else "#{$3}&mdash;#{$5}") + (if $6? then "&nbsp;гг" else "") + (if $9? then $9 else "")
      ]
    
    # Расстановка тире и объединение в неразрывные периоды месяцев
    mdash_month_interval:
      # disabled: true
      pattern: [
        /((январ|феврал|сентябр|октябр|ноябр|декабр)([ьяюе]|[её]м)|(апрел|июн|июл)([ьяюе]|ем)|(март|август)([ауе]|ом)?|ма[йяюе]|маем)\-((январ|феврал|сентябр|октябр|ноябр|декабр)([ьяюе]|[её]м)|(апрел|июн|июл)([ьяюе]|ем)|(март|август)([ауе]|ом)?|ма[йяюе]|маем)/gi
      ]
      replacement: [
        -> "#{$1}&mdash;#{$8}"
      ]
    
    # Расстановка тире и объединение в неразрывные периоды дней
    nbsp_and_dash_month_interval:
      disabled: true
      pattern: [
        /([^\>]|^)(\d+)(\-|\&minus\;|\&mdash\;)(\d+)( |\&nbsp\;)(января|февраля|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря)([^\<]|$)/gi
      ]
      replacement: [
        -> $1 + @tag("#{$2}&mdash;#{$4} #{$6}", "span", {class: "nowrap"}) + $7
      ]
      nowrap: true
    
    # Привязка года к дате
    nobr_year_in_date:
      pattern: [
        /(\s|\&nbsp\;)([0-9]{2}\.[0-9]{2}\.([0-9]{2})?[0-9]{2})(\s|\&nbsp\;)?г(\.|\s|\&nbsp\;)/gi
        /(\s|\&nbsp\;)([0-9]{2}\.[0-9]{2}\.([0-9]{2})?[0-9]{2})(\s|\&nbsp\;|\.(\s|\&nbsp\;|$)|$)/gi
      ]
      replacement: [
        -> $1 + @tag("#{$2} г.", "span", {class: "nowrap"}) + (if $5 is "+" then "" else " ")
        -> $1 + @tag($2, "span", {class: "nowrap"}) + $4
      ]
    
    # Пробел после года
    space_posle_goda:
      pattern: [
        /(^|\040|\&nbsp\;)([0-9]{3,4})(год([ауе]|ом)?)([^a-zа-яё]|$)/gi
      ]
      replacement: [
        -> "#{$1}#{$2} #{$3}#{$5}"
      ]
    
    # Пробел после года
    nbsp_posle_goda_abbr:
      pattern: [
        /(^|\040|\&nbsp\;|\"|\&laquo\;)([0-9]{3,4})[ ]?(г\.)([^a-zа-яё]|$)/gi
      ]
      replacement: [
        -> "#{$1}#{$2}&nbsp;#{$3}#{$4}"
      ]
    
